app/views/recipes/index.html.haml

SELECT `materials`.* FROM `materials` WHERE `materials`.`recipe_id` = 24
---
            %p ○材料
            - recipe.materials.each do |material|
              .main-recipe-right__materials
                .each-materials