app/views/recipes/search.html.haml

          .main-recipe-right__materials
            - recipe.materials.each do |material|
              .main-recipe-right__materials
---
SELECT `materials`.* FROM `materials` WHERE `materials`.`recipe_id` = 26