app/views/recipes/show.html.haml

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
    .each-recipe__user
      %p #{"by" + @recipe.user.name}
    .each-recipe-upper
      .each-recipe-upper__image

SELECT `materials`.* FROM `materials` WHERE `materials`.`recipe_id` = 26
---
        %p.material 材料
        - @recipe.materials.each do |material|
          .each-recipe-upper__materials-name

SELECT `steps`.* FROM `steps` WHERE `steps`.`recipe_id` = 26
---
      %p.step-number 1234
      - @recipe.steps.each do |step|
        .each-recipe-bottom__steps
          .each-recipe-bottom__step