app/controllers/recipes_controller.rb

SELECT COUNT(*) FROM `recipes`
---
  def index
    # @recipes = Recipe.all
    @recipes = Recipe.order("created_at DESC").page(params[:page]).per(5)

INSERT INTO `recipes` (`title`, `image`, `point`, `created_at`, `updated_at`) VALUES ('絶品specialカレー⭐️', '#<ActionDispatch::Http::UploadedFile:0x007fe08daff378>', 'カンタン！！美味しい！！', '2017-05-13 06:20:41', '2017-05-13 06:20:41')
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.save

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 26 LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id])